Revit 2024 API
BuiltInFailures.MEPCalculationFailures.Network_NoOutputNode Property
 The calculation could not be executed as configured. Select an output node before analyzing this network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId Network_NoOutputNode { get; }
Visual Basic
Public Shared ReadOnly Property Network_NoOutputNode As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ Network_NoOutputNode {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace